ciot-platform/ciot_c/src/esp32/ciot_uart.c
/**
 * @file ciot_uart.c
 * @author your name (you@domain.com)
 * @brief
 * @version 0.1
 * @date 2024-06-07
 *
 * @copyright Copyright (c) 2024
 *
 */

#include "ciot_config.h"

#if CIOT_CONFIG_FEATURE_UART == 1 && defined(CIOT_PLATFORM_ESP32)

#include <stdlib.h>
#include "ciot_uart.h"
#include "ciot_err.h"

#include "driver/uart.h"
#include "soc/soc_caps.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"

#ifndef CIOT_CONFIG_UART_RX_BUF_SIZE
#define CIOT_CONFIG_UART_RX_BUF_SIZE 256
#endif

#ifndef CIOT_CONFIG_UART_TX_BUF_SIZE
#define CIOT_CONFIG_UART_TX_BUF_SIZE 256
#endif

#ifndef CIOT_CONFIG_UART_QUEUE_SIZE
#define CIOT_CONFIG_UART_QUEUE_SIZE 10
#endif

#ifndef CIOT_CONFIG_UART_TASK_SIZE
#define CIOT_CONFIG_UART_TASK_SIZE 4096
#endif

#ifndef CIOT_CONFIG_UART_TASK_PRIO
#define CIOT_CONFIG_UART_TASK_PRIO (tskIDLE_PRIORITY + 1)
#endif

#ifndef CIOT_CONFIG_UART_TASK_CORE
#define CIOT_CONFIG_UART_TASK_CORE 0
#endif

static const char *TAG = "ciot_uart";

struct ciot_uart
{
    ciot_uart_base_t base;
    QueueHandle_t queue;
    TaskHandle_t task;
    uart_event_t event;
};

static void ciot_uart0_task(void *args);
static void ciot_uart1_task(void *args);
static void ciot_uart2_task(void *args);
static void ciot_uart_event_handler(ciot_uart_t self, uart_event_t *event);
static ciot_err_t ciot_uart_get_word_length(ciot_uart_data_bits_t data_bits, uart_word_length_t *word_length);
static ciot_err_t ciot_uart_get_stop_bits(ciot_uart_stop_bits_t stop_bits, uart_stop_bits_t *esp_stop_bits);
static ciot_err_t ciot_uart_check_cfg(const ciot_uart_cfg_t *cfg);
static ciot_err_t ciot_uart_param_config(int num, const ciot_uart_cfg_t *cfg);

ciot_uart_t ciot_uart_new(void *handle)
{
    ciot_uart_t self = calloc(1, sizeof(struct ciot_uart));
    ciot_uart_init(self);
    return self;
}

ciot_err_t ciot_uart_start(ciot_uart_t self, ciot_uart_cfg_t *cfg)
{
    CIOT_ERR_NULL_CHECK(self);
    CIOT_ERR_NULL_CHECK(cfg);

    ciot_uart_base_t *base = &self->base;

    if (base->status.state == CIOT_UART_STATE_STARTED &&
        base->cfg.num != cfg->num)
    {
        CIOT_LOGW(TAG, "Can't change UART number from %d to %d. Stop UART first", (int)base->cfg.num, (int)cfg->num);
        return CIOT_ERR_INVALID_STATE;
    }

    CIOT_LOGI(TAG, "num: %d", (int)cfg->num);

    // Reject what the driver can't take before touching the UART: a failed
    // uart_param_config still applies part of the config.
    CIOT_ERR_RETURN(ciot_uart_check_cfg(cfg));

    if (cfg->has_gpio == false || base->status.state == CIOT_UART_STATE_STARTED)
    {
        if(base->status.state == CIOT_UART_STATE_STARTED)
        {
            CIOT_LOGW(TAG, "UART already started. GPIO settings will be ignored");
        }
        cfg->has_gpio = base->cfg.has_gpio;
        cfg->gpio = base->cfg.gpio;
    }

    int num = cfg->num;
    ciot_err_t err = ciot_uart_param_config(num, cfg);
    if (err != CIOT_ERR_OK)
    {
        // Still unreachable baud rates (e.g. below the clock divider range)
        // end up here. Put a running UART back on the config it had.
        if (base->status.state == CIOT_UART_STATE_STARTED)
        {
            ciot_uart_param_config(num, &base->cfg);
        }
        return err;
    }
    base->cfg = *cfg;

    if (base->status.state == CIOT_UART_STATE_STARTED)
    {
        CIOT_LOGI(TAG, "UART already started");
    }
    else
    {
        ESP_ERROR_CHECK(uart_set_pin(num, base->cfg.gpio.tx, base->cfg.gpio.rx, base->cfg.gpio.rts, base->cfg.gpio.cts));
        ESP_ERROR_CHECK(uart_driver_install(num, CIOT_CONFIG_UART_RX_BUF_SIZE, CIOT_CONFIG_UART_TX_BUF_SIZE, CIOT_CONFIG_UART_QUEUE_SIZE, &self->queue, 0));
        if (base->iface.decoder)
        {
            if (num == 0)
                xTaskCreatePinnedToCore(ciot_uart0_task, "ciot_uart0_task", CIOT_CONFIG_UART_TASK_SIZE, self, CIOT_CONFIG_UART_TASK_PRIO, &self->task, CIOT_CONFIG_UART_TASK_CORE);
            if (num == 1)
                xTaskCreatePinnedToCore(ciot_uart1_task, "ciot_uart1_task", CIOT_CONFIG_UART_TASK_SIZE, self, CIOT_CONFIG_UART_TASK_PRIO, &self->task, CIOT_CONFIG_UART_TASK_CORE);
            if (num == 2)
                xTaskCreatePinnedToCore(ciot_uart2_task, "ciot_uart2_task", CIOT_CONFIG_UART_TASK_SIZE, self, CIOT_CONFIG_UART_TASK_PRIO, &self->task, CIOT_CONFIG_UART_TASK_CORE);
        }
    }

    ESP_ERROR_CHECK(uart_set_mode(num, base->cfg.mode));
    base->status.state = CIOT_UART_STATE_STARTED;
    ciot_iface_send_event_type(&base->iface, CIOT_EVENT_TYPE_STARTED);

    return CIOT_ERR_OK;
}

ciot_err_t ciot_uart_stop(ciot_uart_t self)
{
    CIOT_ERR_NULL_CHECK(self);
    CIOT_LOGI(TAG, "Stopping UART %d", (int)self->base.cfg.num);
    if (self->base.status.state == CIOT_UART_STATE_CLOSED)
    {
        CIOT_LOGW(TAG, "UART %d already stopped", (int)self->base.cfg.num);
        return CIOT_ERR_OK;
    }
    uart_driver_delete(self->base.cfg.num);
    self->base.status.state = CIOT_UART_STATE_CLOSED;
    ciot_iface_send_event_type(&self->base.iface, CIOT_EVENT_TYPE_STOPPED);
    vTaskDelete(self->task);
    return CIOT_ERR_OK;
}

ciot_err_t ciot_uart_task(ciot_uart_t self)
{
    CIOT_ERR_NULL_CHECK(self);
    return CIOT_ERR_NOT_IMPLEMENTED;
}

ciot_err_t ciot_uart_send_bytes(ciot_uart_t self, uint8_t *bytes, int size)
{
    CIOT_ERR_NULL_CHECK(self);
    CIOT_ERR_NULL_CHECK(bytes);
    uart_write_bytes(self->base.cfg.num, bytes, size);
    return CIOT_ERR_OK;
}

ciot_err_t ciot_uart_read_bytes(ciot_uart_t self, uint8_t *bytes, int size)
{
    CIOT_ERR_NULL_CHECK(self);
    CIOT_ERR_NULL_CHECK(bytes);
    int read = uart_read_bytes(self->base.cfg.num, bytes, size, pdMS_TO_TICKS(self->base.cfg.read_timeout));
    return read == size ? CIOT_ERR_OK : CIOT_ERR_TIMEOUT;
}

size_t ciot_uart_available(ciot_uart_t self)
{
    if(self == NULL)
    {
        CIOT_LOGE(TAG, "ciot_uart_available: self is NULL");
        return 0;
    }
    size_t available = 0;
    esp_err_t err = uart_get_buffered_data_len(self->base.cfg.num, &available);
    if (err != ESP_OK)
    {
        CIOT_LOGE(TAG, "uart_get_buffered_data_len failed (%d)", (int)err);
        return 0;
    }
    return available;
}

static void ciot_uart0_task(void *args)
{
    ciot_uart_t self = (ciot_uart_t)args;
    CIOT_LOGI(TAG, "uart0 task started");

    while (true)
    {
        if (xQueueReceive(self->queue, (void *)&self->event, portMAX_DELAY))
        {
            ciot_uart_event_handler(self, &self->event);
        }
    }
}

static void ciot_uart1_task(void *args)
{
    ciot_uart_t self = (ciot_uart_t)args;
    CIOT_LOGI(TAG, "uart1 task started");

    while (true)
    {
        if (xQueueReceive(self->queue, (void *)&self->event, portMAX_DELAY))
        {
            ciot_uart_event_handler(self, &self->event);
        }
    }
}

static void ciot_uart2_task(void *args)
{
    ciot_uart_t self = (ciot_uart_t)args;
    CIOT_LOGI(TAG, "uart2 task started");

    while (true)
    {
        if (xQueueReceive(self->queue, (void *)&self->event, portMAX_DELAY))
        {
            ciot_uart_event_handler(self, &self->event);
        }
    }
}

static ciot_err_t ciot_uart_check_cfg(const ciot_uart_cfg_t *cfg)
{
    if (cfg->baud_rate == 0 || cfg->baud_rate > SOC_UART_BITRATE_MAX)
    {
        CIOT_LOGE(TAG, "Invalid baud rate: %u (max %u)", (unsigned)cfg->baud_rate, (unsigned)SOC_UART_BITRATE_MAX);
        return CIOT_ERR_INVALID_ARG;
    }

    uart_word_length_t word_length;
    uart_stop_bits_t stop_bits;
    CIOT_ERR_RETURN(ciot_uart_get_word_length(cfg->data_bits, &word_length));
    CIOT_ERR_RETURN(ciot_uart_get_stop_bits(cfg->stop_bits, &stop_bits));
    return CIOT_ERR_OK;
}

static ciot_err_t ciot_uart_param_config(int num, const ciot_uart_cfg_t *cfg)
{
    uart_word_length_t word_length;
    uart_stop_bits_t stop_bits;
    CIOT_ERR_RETURN(ciot_uart_get_word_length(cfg->data_bits, &word_length));
    CIOT_ERR_RETURN(ciot_uart_get_stop_bits(cfg->stop_bits, &stop_bits));

    const uart_config_t uart_cfg = {
        .flow_ctrl = cfg->flow_control,
        .parity = cfg->parity,
        .baud_rate = cfg->baud_rate,
        .data_bits = word_length,
        .stop_bits = stop_bits,
        .source_clk = UART_SCLK_DEFAULT,
    };

    esp_err_t err = uart_param_config(num, &uart_cfg);
    if (err != ESP_OK)
    {
        CIOT_LOGE(TAG, "uart_param_config failed: %s", esp_err_to_name(err));
        return CIOT_ERR_INVALID_ARG;
    }
    return CIOT_ERR_OK;
}

static ciot_err_t ciot_uart_get_word_length(ciot_uart_data_bits_t data_bits, uart_word_length_t *word_length)
{
    switch (data_bits)
    {
    case CIOT_UART_DATA_BITS_8:
        *word_length = UART_DATA_8_BITS;
        return CIOT_ERR_OK;
    case CIOT_UART_DATA_BITS_7:
        *word_length = UART_DATA_7_BITS;
        return CIOT_ERR_OK;
    case CIOT_UART_DATA_BITS_6:
        *word_length = UART_DATA_6_BITS;
        return CIOT_ERR_OK;
    case CIOT_UART_DATA_BITS_5:
        *word_length = UART_DATA_5_BITS;
        return CIOT_ERR_OK;
    default:
        CIOT_LOGE(TAG, "Invalid data bits: %d", (int)data_bits);
        return CIOT_ERR_INVALID_ARG;
    }
}

static ciot_err_t ciot_uart_get_stop_bits(ciot_uart_stop_bits_t stop_bits, uart_stop_bits_t *esp_stop_bits)
{
    switch (stop_bits)
    {
    case CIOT_UART_STOP_BITS_1:
        *esp_stop_bits = UART_STOP_BITS_1;
        return CIOT_ERR_OK;
    case CIOT_UART_STOP_BITS_1_5:
        *esp_stop_bits = UART_STOP_BITS_1_5;
        return CIOT_ERR_OK;
    case CIOT_UART_STOP_BITS_2:
        *esp_stop_bits = UART_STOP_BITS_2;
        return CIOT_ERR_OK;
    default:
        CIOT_LOGE(TAG, "Invalid stop bits: %d", (int)stop_bits);
        return CIOT_ERR_INVALID_ARG;
    }
}

static void ciot_uart_event_handler(ciot_uart_t self, uart_event_t *event)
{
    ciot_uart_base_t *base = &self->base;
    size_t rx_buffer_used = 0;

    switch (event->type)
    {
    case UART_DATA:
        while (event->size)
        {
            uint8_t byte;
            uart_read_bytes(base->cfg.num, &byte, 1, portMAX_DELAY);
            event->size--;
            ciot_iface_process_data(&base->iface, &byte, 1, CIOT_EVENT_TYPE_MSG);
        }
        break;
    case UART_FIFO_OVF:
        ESP_LOGE(TAG, "UART_FIFO_OVF[%ld]", base->cfg.num);
        base->status.error = CIOT_UART_ERROR_FIFO_OVERFLOW;
        uart_flush_input(base->cfg.num);
        xQueueReset(self->queue);
        break;
    case UART_BUFFER_FULL:
        esp_err_t esp_err = uart_get_buffered_data_len(base->cfg.num, &rx_buffer_used);
        ESP_LOGE(TAG,
                 "UART_BUFFER_FULL[%lu]: event_size=%lu, rx_used=%lu/%u%s",
                 (unsigned long)base->cfg.num,
                 (unsigned long)event->size,
                 (unsigned long)rx_buffer_used,
                 (unsigned)CIOT_CONFIG_UART_RX_BUF_SIZE,
                  esp_err == ESP_OK ? "" : " (uart_get_buffered_data_len failed)");
        base->status.error = CIOT_UART_ERROR_BUFFER_FULL;
        uart_flush_input(base->cfg.num);
        xQueueReset(self->queue);
        break;
    case UART_BREAK:
        ESP_LOGE(TAG, "UART_BREAK[%ld]", base->cfg.num);
        base->status.error = CIOT_UART_ERROR_BREAK;
        uart_flush_input(base->cfg.num);
        xQueueReset(self->queue);
        break;
    case UART_FRAME_ERR:
        ESP_LOGE(TAG, "UART_FRAME_ERR[%ld]", base->cfg.num);
        base->status.error = CIOT_UART_ERROR_FRAME;
        uart_flush_input(base->cfg.num);
        xQueueReset(self->queue);
        break;
    default:
        ESP_LOGW(TAG, "unhandled event: %d", event->type);
        break;
    }
}

#endif //! CIOT_CONFIG_FEATURE_UART == 1
